{"project_title":"Biology Lesson Plan",
    "outline_layers":
        {"layer_name":"Outline",
            "outline_items":[
                {"title":"Select Topic",
                "description":"Choose a relevant and engaging biology topic for 9th graders.",
                "criteria_for_success":"Topic is age-appropriate, aligns with curriculum standards, and captures students' interest.",
                "justification":"An engaging topic ensures students are interested and motivated to learn, while curriculum alignment supports educational standards."},
                {"title":"Develop Objectives",
                "description":"Define clear learning objectives for what students should know or be able to do by the end of the lesson.",
                "criteria_for_success":"Objectives are specific, measurable, achievable, relevant, and time-bound (SMART).",
                "justification":"Clear objectives guide both teaching methods and assessment, providing a clear focus for both instructor and students."},
                {"title":"Create Lesson Plan",
                "description":"Outline lesson structure including introduction, main activities, and conclusion.",
                "criteria_for_success":"Structured plan includes interactive activities, assessments, and balances teacher talk with student engagement.",
                "justification":"A structured lesson ensures that time is well-managed, content is delivered effectively, and learner engagement is maximized."},
                {"title":"Prepare Materials",
                "description":"Gather and prepare all necessary materials such as handouts, presentation slides, and experimental tools.",
                "criteria_for_success":"All materials are ready before the lesson and enhance the learning experience.",
                "justification":"Prepared materials ensure that the lesson flows smoothly without interruptions and support diverse learning styles."},
                {"title":"Evaluate Lesson",
                "description":"Assess student learning and lesson effectiveness through feedback and performance evaluation.",
                "criteria_for_success":"Feedback is collected and analyzed to measure student understanding and engagement.",
                "justification":"Evaluation provides insights into what worked well and areas for improvement, helping to refine future lessons."}]}}